<?php
/*
打印所有的四位水仙花数
如：1532 = 1*1*1*1 + 5*5*5*5 + 3*3*3*3 + 2*2*2*2
*/

#思路：计算机程序只会“挨个”试 1000/1001/1002...9999
#循环条件： $i=1000,   $i<=9999
#循环体：取$i千位、取$i百位、取$i十位、取$i个位、四次方和与$i判定是否相等
$i = 1000;

while($i<10000){					
	//取$i的千位
	#$qian = ($i-$i%1000)/1000;
	$qian = (int)($i/1000);
	//取$i的百位
	#$bai = (int)(($i-$qian*1000)/100); 
	$bai = (int)(($i%1000)/100);
	//取$i的十位
	$shi = (int)($i%100/10);
	//取$i的个位
	$ge = $i%10;
	//判定是否相等
	//if($i===$qian*$qian*$qian*$qian+$bai*$bai*$bai*$bai+$shi*$shi*$shi*$shi+$ge*$ge*$ge*$ge){
	if($i===pow($qian,4)+pow($bai,4)+pow($shi,4)+pow($ge,4)){
		echo "$i &nbsp;&nbsp;";
	}
	$i++;
}

